RIET/src/Documents/ServicesCostsAllocation/ServicesCostsAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ServicesCostsAllocation</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.DutiesRecharged</registerRecords>
  <registerRecords>AccumulationRegister.NotReceivedAgentInvoices</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Service</name>
      <type>
        <types>DocumentRef.Service</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Catalogs/ProcessLevels/ProcessLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProcessLevels</name>
  <predefined>
    <items>
      <name>AZ</name>
      <description>Azerbaijan</description>
    </items>
    <items>
      <name>GE</name>
      <description>Georgia</description>
    </items>
    <items>
      <name>KZ</name>
      <description>Kazakhstan</description>
    </items>
    <items>
      <name>RUEA</name>
      <description>Russia East</description>
    </items>
    <items>
      <name>RUSM</name>
      <description>Russia Smith</description>
    </items>
    <items>
      <name>RUWE</name>
      <description>Russia West</description>
    </items>
    <items>
      <name>TM</name>
      <description>TM</description>
    </items>
    <items>
      <name>UZ</name>
      <description>Uzbekistan</description>
    </items>
  </predefined>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Corporation</name>
    <type>
      <types>CatalogRef.Corporations</types>
    </type>
  </attributes>
  <attributes>
    <name>LeaveDocumentsInDesktopUntilAllItemsAreInCustomsFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailsForTemporaryItemsNotification</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FromTMSIDsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FromTMSIDs</name>
    <attributes>
      <name>FromTMSID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Documents/ServicesCostsAllocation/ManagerModule.bsl
Функция НайтиПоService(Service) Экспорт
	
	// Возвращает не помеченный на удаление SCA, в котором указан переданный Service
	
	Если НЕ ЗначениеЗаполнено(Service) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Service", Service);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ServicesCostsAllocationServices.Ссылка
		|ИЗ
		|	Документ.ServicesCostsAllocation.Services КАК ServicesCostsAllocationServices
		|ГДЕ
		|	ServicesCostsAllocationServices.Service = &Service
		|	И НЕ ServicesCostsAllocationServices.Ссылка.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// { RGS ASeryakov, 25.07.2018 14:55:14 S-I-0005241
Функция ЭтоServicesCostsAllocation_AZ_TM(Ссылка) Экспорт

	DocumentBase = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка.Services[0].Service, "DocumentBase");
	ProcessLevel = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(DocumentBase, "ProcessLevel");
	
	Если ТипЗнч(DocumentBase) = Тип("ДокументСсылка.CustomsFilesLight") И ProcessLevel = Справочники.ProcessLevels.AZ
		ИЛИ (ТипЗнч(DocumentBase) = Тип("ДокументСсылка.CustomsFilesLight") И ProcessLevel = Справочники.ProcessLevels.TM) Тогда
	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // } RGS ASeryakov 25.07.2018 14:55:24 S-I-0005241
